---
type: DocumentEntryPoint
namespace: Autodesk.Revit.UI.Macros
version: 2024
members: 30
tags: [revit-api, class]
---

# DocumentEntryPoint

`Autodesk.Revit.UI.Macros.DocumentEntryPoint` · Revit 2024 · 30 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | DocumentEntryPoint | — | `public DocumentEntryPoint ()` |
| Constructor | DocumentEntryPoint | — | `public DocumentEntryPoint ()` |
| Method | Close | — | `` |
| Method | Delete | — | `` |
| Method | Export | — | `` |
| Method | FinishInitializationEO | 2014 | `public void FinishInitializationEO ()` |
| Method | FinishInitializationEO | — | `public void FinishInitializationEO ()` |
| Method | GetElement | — | `` |
| Method | GetRoomAtPoint | — | `` |
| Method | GetSpaceAtPoint | — | `` |
| Method | GetSubelement | — | `` |
| Method | Import | — | `` |
| Method | Initialize | 2014 | `public void Initialize ( Object obj , string addinFolder )` |
| Method | Initialize | — | `public void Initialize ( Object obj , string addinFolder )` |
| Method | Link | — | `` |
| Method | LoadFamily | — | `` |
| Method | LoadFamilySymbol | — | `` |
| Method | OnShutdownEO | 2014 | `public void OnShutdownEO ()` |
| Method | OnShutdownEO | — | `public void OnShutdownEO ()` |
| Method | Paint | — | `` |
| Method | Print | — | `` |
| Method | PromptForFamilyInstancePlacement | — | `` |
| Method | Save | — | `` |
| Method | SaveAs | — | `` |
| Method | SaveAs | — | `` |
| Method | ShowElements | — | `` |
| Property | AddinFolder | 2014 | `public string AddinFolder { get ; }` |
| Property | AddinFolder | — | `public string AddinFolder { get ; }` |
| Property | PlanTopologies | — | `` |
| Property | PlanTopology | — | `` |